import numpy as np


phases_dict_eng = {
    0: 'al-Al2O3',
    1: 'ga-Al2O3',
    2: 'Cry',
    3: 'Chi',
    4: 'CaCry1',
    5: 'CaCry1.5',
    6: 'Flu',
    7: 'Web',
    8: 'Neib',
    9: 'Elpas',
    10: 'K1.58Al11O17',
    11: 'NaF'
}

phases_dict_rus = {
    0: 'Альфа-Al2O3',
    1: 'Гамма-Al2O3',
    2: 'Криолит',
    3: 'Хиолит',
    4: '1-Ca-криолит',
    5: '1.5-Ca-криолит',
    6: 'Флюорит',
    7: 'Веберит',
    8: 'Нейборит',
    9: 'Эльпасолит',
    10: 'K1.58Al11O17',
    11: 'NaF'
}

# Массив заголовков фаз
headers_short = [
    'al-Al2O3',      # индекс 0
    'ga-Al2O3',      # 1
    'Cry',           # 2
    'Chi',           # 3
    'CaCry1',        # 4
    'CaCry1.5',      # 5
    'Flu',           # 6
    'Web',           # 7
    'Neib',          # 8
    'Elpas',         # 9
    'K1.58Al11O17',  # 10
    'NaF'            # 11
]

headers_rus = [
    'Альфа-Al2O3',
    'Гамма-Al2O3',
    'Криолит',
    'Хиолит',
    '1-Ca-криолит',
    '1.5-Ca-криолит',
    'Флюорит',
    'Веберит',
    'Нейборит',
    'Эльпасолит',
    'K1.58Al11O17',
    'NaF'
]


target_values = {
    'Бо1125_180121.xy': np.array([0.42, 0.25, 42.72, 44.65, 2.22, 8.05, 0.00, 1.40, 0.28, 0.00, 0.01, 0.00]),
    'Бо2074_200121.xy': np.array([0.50, 0.24, 58.48, 27.85, 2.88, 7.90, 0.05, 1.62, 0.48, 0.00, 0.01, 0.00]),
    'Бо2077_200121.xy': np.array([0.40, 0.93, 67.24, 18.25, 3.63, 7.51, 0.03, 1.60, 0.42, 0.00, 0.00, 0.00]),
    'Бр1026_181220.xy': np.array([2.72, 2.78, 47.84, 28.73, 1.20, 14.57, 0.07, 2.06, 0.03, 0.00, 0.00, 0.00]),
    'Бр1071_241220.xy': np.array([1.22, 0.63, 50.30, 30.39, 1.60, 13.97, 0.06, 1.84, 0.00, 0.00, 0.00, 0.00]),
    'Бр1307_2_181220.xy': np.array([0.68, 1.17, 86.07, 0.94, 3.65, 1.29, 4.55, 0.31, 0.79, 0.05, 0.52, 0.00]),
    'Бр1356_251220.xy': np.array([1.67, 2.21, 78.72, 2.34, 7.51, 3.22, 2.43, 1.09, 0.51, 0.28, 0.02, 0.00]),
    'Бр1425_241220.xy': np.array([0.90, 1.56, 81.95, 1.43, 6.32, 2.76, 3.40, 0.85, 0.68, 0.16, 0.00, 0.00])
}

# Функция для расчёта криолитового отношения (КО)
def compute_cr(values):
    """
    Принимает массив из 12 чисел (в порядке headers) и возвращает КО.
    """
    # Извлекаем нужные компоненты по индексам
    Cry = values[2]      # 2
    Chi = values[3]      # 3
    CaCry1 = values[4]   # 4
    CaCry1_5 = values[5] # 5
    Web = values[7]      # 7
    Neib = values[8]     # 8
    Elpas = values[9]    # 9
    NaF = values[11]     # 11

    numerator = 2 * (0.6 * Cry + 0.4545 * Chi + 0.1727 * CaCry1_5 + 0.2058 * CaCry1 + 0.3647 * Web + 0.4026 * Neib + 0.1734 * Elpas + NaF)

    denominator = (0.4 * Cry + 0.5455 * Chi + 0.3454 * CaCry1_5 + 0.4116 * CaCry1 + 0.3647 * Web + 0.3468 * Elpas)

    if denominator == 0:
        return float('inf')  # или другое значение по умолчанию
    return numerator / denominator

# Пример расчёта для первого образца
sample = 'Бо1125_180121.xy'
values = target_values[sample]
cr = compute_cr(values)
print(f"{sample}: КО = {cr:.4f}")